a = [35, 12, -3, 76, 67, -34, 7, 2, 9]
g = []
print("Список содержит " + str(a))
# a.sort()
b = 0
c = 0
d = 0
e = 1
for i in a:
    if i < 0:
        b += i
        g.append(b)
print("Створити список цілих, що містить лише негативні числа з першого списку; " + str(g))
g.clear()
for z in a:
    if z % 2 == 0:
        g.append(z)
        c += z
print("Створити список цілих, що містить лише парні числа з першого списку; " + str(g))
g.clear()
for y in a:
    if y % 2 != 0:
        d += y
        g.append(y)
print("Створити список цілих, що містить лише непарні числа з першого списку; " + str(g))
g.clear()
for x in a:
    if x % 3 == 0:
        if x > 0:
            e *= x

for u in a:
    if u > 0:
        g.append(u)
        f = min(g) * max(g)
print("Створити список цілих, що містить лише позитивні числа з першого списку." + str(g))
print("Добуток елементів між мінімальним та максимальним елементом; " + str(f))
print("Добуток елементів з кратними індексами 3; " + str(e))
print("Суму парних чисел; " + str(d))
print("Суму непарних чисел; " + str(c))
print("Суму негативних чисел; " + str(b))
